{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their corresponding source files, components, and test IDs for the NEPSE trading dashboard.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing the purpose and key functionality of each component, utility, and style file.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML shell for the React SPA, setting the page title to 'NEPSE Short-Swing Trading Dashboard' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root application component that wraps the dashboard in TradingProvider and renders all major sections in order, including Navbar, RiskAlertBanner, and all trading dashboard panels.",
  "frontend/src/components/ActiveTradeLog.tsx": "Active trade log component rendering a sortable table of open trades with inline current-price editing, P&L coloring, and close/flag/delete actions via a CloseTradeDialog.",
  "frontend/src/components/BiasAudit.tsx": "Daily behavioral bias audit component with five Yes/No/Unsure toggle questions, contextual warnings for risky answers, a plan adherence slider, and a computed BIAS STATUS indicator.",
  "frontend/src/components/CloseTradeDialog.tsx": "Modal dialog for closing an open trade by entering an exit price, showing a live preview of net P&L and R-multiple before confirming.",
  "frontend/src/components/EdisConfirmationModal.tsx": "Warning modal that alerts the user about pending EDIS (Electronic Delivery Instruction Slip) actions required for T+1 sell trades, with a confirmation button to dismiss.",
  "frontend/src/components/JournalMetrics.tsx": "Dashboard section displaying computed and manually-editable trading metrics (win rate, P&L per trade, drawdown, etc.) alongside an equity curve and playbook performance table.",
  "frontend/src/components/MarketClosedOverlay.tsx": "Fixed banner shown below the navbar when the NEPSE market is closed, polling market status every 10 seconds.",
  "frontend/src/components/MarketStatus.tsx": "Small indicator component that displays a live OPEN/CLOSED market status badge, updating every 10 seconds.",
  "frontend/src/components/MetricCard.tsx": "Reusable card component that displays a labeled metric value with optional inline editing for manually-entered metrics and color-coded highlights.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar showing the app logo, market status, Nepal clock, account equity input, daily max-loss badge, and a settings dialog with import/export controls.",
  "frontend/src/components/NepalClock.tsx": "Displays the current Nepal Standard Time (NST) updated every second.",
  "frontend/src/components/OperationalChecklist.tsx": "Collapsible daily checklist panel with checkboxes for pre-market operational tasks (EDIS, margin buffer, etc.) and a completion progress bar.",
  "frontend/src/components/PlaybookCard.tsx": "Displays a collapsible card for a single trading playbook with category badge, entry/exit rules, and an embedded TradeCalculator that expands on demand.",
  "frontend/src/components/PlaybookPerformanceTable.tsx": "Renders a table summarizing per-playbook performance metrics (trade count, win rate, avg R, best/worst trade) derived from closed trades.",
  "frontend/src/components/PLEquityCurve.tsx": "Renders a dual-axis line chart showing cumulative P&L and R-multiple equity curve over time using Recharts, pulling data from closed trades in TradingContext.",
  "frontend/src/components/PortfolioAllocationGauge.tsx": "Shows current vs. target portfolio allocation across event, momentum, and intraday categories using a donut chart and progress bars, with rebalancing warnings.",
  "frontend/src/components/QuickLinksPanel.tsx": "Displays two groups of external links (official sources and aggregators) with checkmark buttons that record the last-checked timestamp for each link.",
  "frontend/src/components/RiskAlertBanner.tsx": "Renders a toggleable risk alert banner with color-coded buttons for NEPSE-specific risks (EDIS, closeout, supply shock, etc.) and triggers an EDIS confirmation modal on red alerts.",
  "frontend/src/components/SignalCard.tsx": "Displays a market signal card with a cyclable status badge (ACTIVE/WATCH/CLEAR) and an inline form for appending ticker/notes data entries to the signal.",
  "frontend/src/components/SignalCatalystEngine.tsx": "Renders the 12-Signal Catalyst Engine section, sorting signals by status priority and displaying them in a responsive grid using SignalCard components alongside a SignalSummaryBar.",
  "frontend/src/components/SignalSummaryBar.tsx": "Displays a summary bar showing counts of active risk, active opportunity, watch, and neutral signals derived from the trading context.",
  "frontend/src/components/TradeCalculator.tsx": "Provides a form-based trade calculator that computes position sizing from entry/stop prices and account equity, and allows saving the resulting trade to the trade log.",
  "frontend/src/components/TradeIdeaBuilder.tsx": "Defines and renders a list of NEPSE-specific trading playbooks (event, momentum, intraday) as PlaybookCard components with entry/exit rules and rationale.",
  "frontend/src/components/WeeklyReview.tsx": "Computes and displays a weekly performance review including hit rate, drawdown, playbook rankings, and AI-generated recommendations, toggled manually or automatically on Sundays.",
  "frontend/src/contexts/TradingContext.tsx": "Defines the global TradingContext with default state including 12 signals, quick links, and provides state management for trades, signals, settings, and metrics throughout the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/index.css": "Global stylesheet defining a terminal-style dark theme with Bloomberg-inspired CSS variables, custom scrollbars, utility animations, and print styles for weekly review export.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/trading.ts": "Defines all core TypeScript types and interfaces for the trading dashboard, including Signal, Trade, ChecklistState, BiasAuditDay, AlertState, and the top-level TradingState.",
  "frontend/src/utils/allocation.ts": "Calculates portfolio allocation percentages by playbook category (event, momentum, intraday) from open trades and generates rebalancing warnings when categories exceed target thresholds by 10%.",
  "frontend/src/utils/metrics.ts": "Provides trade performance calculation functions including win rate, average holding days, net P&L, win/loss ratio, max drawdown, R-multiples, and per-playbook performance summaries.",
  "frontend/src/utils/nepalTime.ts": "Utility functions for Nepal Standard Time (UTC+5:45) conversion, market hours detection (Sun–Thu, 11:00–15:00 NST), and NST date/time formatting.",
  "frontend/src/utils/positionSizing.ts": "Calculates position sizing based on account equity, risk percent, entry/stop prices, and liquidity constraints, returning share counts, R-value, breakeven percentage, and liquidity warnings.",
  "frontend/src/utils/weeklyRecommendations.ts": "Generates actionable weekly trading recommendations based on performance metrics such as hit rate, chase rate, EDIS errors, plan adherence, and rule adherence against defined targets.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the NEPSE dashboard frontend, extending the default theme with custom colors (including terminal-specific tokens), fonts, border radii, shadows, and animations using oklch color space and CSS variables.",
  "project_state.json": "Project state manifest (schema v1.0.0, version 3) describing the NEPSE Short-Swing Trading Dashboard's architecture, existing implemented features, known issues, and requirements including NEPSE market rules, position sizing logic, and UI gating behavior."
}